NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/verificationAndValidation/multiphase/interIsoFoam/porousDamBreak/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
    CrossPowerLawCoeffs
    {
        nu0         1e-06;
        nuInf       1e-06;
        m           1;
        n           0;
    }

    BirdCarreauCoeffs
    {
        nu0         0.0142515;
        nuInf       1e-06;
        k           99.6;
        n           0.1003;
    }
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    CrossPowerLawCoeffs
    {
        nu0         1e-06;
        nuInf       1e-06;
        m           1;
        n           0;
    }

    BirdCarreauCoeffs
    {
        nu0         0.0142515;
        nuInf       1e-06;
        k           99.6;
        n           0.1003;
    }
}

sigma               0.0;


// ************************************************************************* //
